Conf.Simple/src/InformationRegisters/SUI_ДанныеКодовМаркировки/SUI_ДанныеКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ДанныеКодовМаркировки</name>
  <resources>
    <name>ДанныеДляЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючФоновогоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/CommonModules/SUI_ДанныеКодовМаркировки/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработатьСоставКодовМаркировокВФоне(МобильноеУстройство, ИдентификаторЗапроса) Экспорт

	Попытка

		ПодключеннаяИнтеграционнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту(
		"ИмяОбъекта", SUI_ОбменДаннымиСервер.ИмяВнешнейОбработкиГИСМТ());
		
		Запись = РегистрыСведений.SUI_ДанныеКодовМаркировки.СоздатьМенеджерЗаписи();
		Запись.МобильноеУстройство = МобильноеУстройство;
		Запись.УникальныйИдентификатор = ИдентификаторЗапроса;
		Запись.Прочитать();
		
		ДанныеДляЗапроса = Запись.ДанныеДляЗапроса.Получить();
		
		SUI_ОбменДаннымиСервер.ВыполнитьПроверкиПередЗапускомИнтеграционнойОбработкиГИСМТ(ДанныеДляЗапроса,
			ПодключеннаяИнтеграционнаяОбработка);
		
		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("ДополнительнаяОбработкаСсылка", ПодключеннаяИнтеграционнаяОбработка);
		ПараметрыКоманды.Вставить("ИдентификаторКоманды", "ЗапросСоставаКодовМаркировки");
		ПараметрыКоманды.Вставить("ОбъектыНазначения", Новый Массив);
		ПараметрыКоманды.Вставить("Штрихкоды", ДанныеДляЗапроса);

		РезультатВыполнения = ДополнительныеОтчетыИОбработки.ВыполнитьКоманду(ПараметрыКоманды);

		Запись.Результат = Новый ХранилищеЗначения(РезультатВыполнения);
		Запись.Выполнено = Истина;
		Запись.ДатаОбновления = ТекущаяДатаСеанса();
		Запись.Записать();

	Исключение

		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации("Данные кодов маркировки", ,
			Метаданные.РегистрыСведений.SUI_ДанныеКодовМаркировки.МодульМенеджера, , ИнформацияОбОшибке());

		Запись = РегистрыСведений.SUI_ДанныеКодовМаркировки.СоздатьМенеджерЗаписи();
		Запись.МобильноеУстройство = МобильноеУстройство;
		Запись.УникальныйИдентификатор = ИдентификаторЗапроса;
		Запись.Прочитать();

		Запись.ТекстОшибки = ОписаниеОшибки();
		Запись.Выполнено = Ложь;
		Запись.ДатаОбновления = ТекущаяДатаСеанса();
		Запись.Записать();

	КонецПопытки;

КонецПроцедуры

#КонецОбласти
